eisup_2019_docmng_integration/src/Documents/абс_ЗакрытиеЗаявокНаОбеспечениеТМЦ/абс_ЗакрытиеЗаявокНаОбеспечениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗакрытиеЗаявокНаОбеспечениеТМЦ</name>
  <registerRecords>AccumulationRegister.абс_ЗаявкиНаОбеспечение</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТМЦ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗаявкиНаОбеспечение/абс_ЗаявкиНаОбеспечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗаявкиНаОбеспечение</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ЗакрытиеЗаявокНаОбеспечениеТМЦ/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстЗаказов.Номенклатура,
	               |	ОстЗаказов.Склад,
	               |	ОстЗаказов.СерияНоменклатуры,
	               |	ОстЗаказов.Заказ,
	               |	ОстЗаказов.Организация,
	               |	ОстЗаказов.Проект,
	               |	ОстЗаказов.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.абс_ЗаявкиНаОбеспечение.Остатки(&ДатаДок, Заказ В (&Заявка)) КАК ОстЗаказов";
	
	Запрос.УстановитьПараметр("ДатаДок", 	Дата);
	Запрос.УстановитьПараметр("Заявка", 	Заявки.ВыгрузитьКолонку("Заявка"));
	
	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
	Если Найти(Комментарий, "Приход") <> 0 Тогда
		Для каждого СтрЗап Из РезультатЗапроса Цикл
			Движение 				= Движения.абс_ЗаявкиНаОбеспечение.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			ЗаполнитьЗначенияСвойств(Движение, СтрЗап);
		КонецЦикла;
	Иначе
		Для каждого СтрЗап Из РезультатЗапроса Цикл
			Движение 				= Движения.абс_ЗаявкиНаОбеспечение.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			ЗаполнитьЗначенияСвойств(Движение, СтрЗап);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
